jmeter/results/report-booking-b+c+k/statistics.json
{
  "Create Payment" : {
    "transaction" : "Create Payment",
    "sampleCount" : 191,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 500.34554973821974,
    "medianResTime" : 456.0,
    "minResTime" : 427.0,
    "maxResTime" : 1102.0,
    "pct1ResTime" : 643.6,
    "pct2ResTime" : 705.3999999999999,
    "pct3ResTime" : 1020.1199999999985,
    "throughput" : 0.6587365364253714,
    "receivedKBytesPerSec" : 0.8594453248674767,
    "sentKBytesPerSec" : 0.39176811590141714
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 955,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 605.7434554973822,
    "medianResTime" : 435.0,
    "minResTime" : 146.0,
    "maxResTime" : 2139.0,
    "pct1ResTime" : 1454.0,
    "pct2ResTime" : 1562.1999999999998,
    "pct3ResTime" : 1754.7599999999998,
    "throughput" : 3.2036766802529395,
    "receivedKBytesPerSec" : 19.577484343288212,
    "sentKBytesPerSec" : 1.7168590864489506
  },
  "Create Booking" : {
    "transaction" : "Create Booking",
    "sampleCount" : 194,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 310.72164948453616,
    "medianResTime" : 297.0,
    "minResTime" : 285.0,
    "maxResTime" : 946.0,
    "pct1ResTime" : 327.0,
    "pct2ResTime" : 376.5,
    "pct3ResTime" : 584.0500000000043,
    "throughput" : 0.6608169605144835,
    "receivedKBytesPerSec" : 0.9002340428883832,
    "sentKBytesPerSec" : 0.48206081006281165
  },
  "View Bookings" : {
    "transaction" : "View Bookings",
    "sampleCount" : 187,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 284.4010695187165,
    "medianResTime" : 236.0,
    "minResTime" : 146.0,
    "maxResTime" : 856.0,
    "pct1ResTime" : 433.0000000000001,
    "pct2ResTime" : 531.9999999999998,
    "pct3ResTime" : 797.9200000000003,
    "throughput" : 0.662113309893814,
    "receivedKBytesPerSec" : 16.817670464302534,
    "sentKBytesPerSec" : 0.29290754822450954
  },
  "Login Request" : {
    "transaction" : "Login Request",
    "sampleCount" : 195,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 490.65641025641025,
    "medianResTime" : 413.0,
    "minResTime" : 325.0,
    "maxResTime" : 915.0,
    "pct1ResTime" : 766.4000000000001,
    "pct2ResTime" : 822.5999999999999,
    "pct3ResTime" : 869.8799999999997,
    "throughput" : 0.6585946603171386,
    "receivedKBytesPerSec" : 1.092083723846193,
    "sentKBytesPerSec" : 0.16336234738335276
  },
  "Process Payment" : {
    "transaction" : "Process Payment",
    "sampleCount" : 188,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1456.2659574468082,
    "medianResTime" : 1454.0,
    "minResTime" : 1128.0,
    "maxResTime" : 2139.0,
    "pct1ResTime" : 1688.2,
    "pct2ResTime" : 1755.1999999999998,
    "pct3ResTime" : 2022.409999999998,
    "throughput" : 0.6553239845092564,
    "receivedKBytesPerSec" : 0.8690722372691116,
    "sentKBytesPerSec" : 0.4377359427776674
  }
}