jmeter/results/report-cache-b+c+k/statistics.json
{
  "GET /hotels/locations?query=New" : {
    "transaction" : "GET /hotels/locations?query=New",
    "sampleCount" : 3312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 262.8614130434789,
    "medianResTime" : 177.0,
    "minResTime" : 151.0,
    "maxResTime" : 1546.0,
    "pct1ResTime" : 483.7000000000003,
    "pct2ResTime" : 494.0,
    "pct3ResTime" : 523.7399999999998,
    "throughput" : 28.29100786715527,
    "receivedKBytesPerSec" : 61.030113650923816,
    "sentKBytesPerSec" : 4.530981728724086
  },
  "GET /flights/prices-by-date" : {
    "transaction" : "GET /flights/prices-by-date",
    "sampleCount" : 2405,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 407.8902286902278,
    "medianResTime" : 389.0,
    "minResTime" : 154.0,
    "maxResTime" : 2200.0,
    "pct1ResTime" : 709.4000000000001,
    "pct2ResTime" : 813.0,
    "pct3ResTime" : 1117.94,
    "throughput" : 20.748140863053646,
    "receivedKBytesPerSec" : 87.95671824855064,
    "sentKBytesPerSec" : 3.566086710837345
  },
  "GET /cars/search - Los Angeles" : {
    "transaction" : "GET /cars/search - Los Angeles",
    "sampleCount" : 2757,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.30214000725444,
    "medianResTime" : 82.0,
    "minResTime" : 76.0,
    "maxResTime" : 335.0,
    "pct1ResTime" : 90.0,
    "pct2ResTime" : 94.0,
    "pct3ResTime" : 114.0,
    "throughput" : 23.37054649950411,
    "receivedKBytesPerSec" : 80.40472198999313,
    "sentKBytesPerSec" : 5.317712240609821
  },
  "Login - Get Auth Token" : {
    "transaction" : "Login - Get Auth Token",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1230.0,
    "medianResTime" : 1230.0,
    "minResTime" : 1230.0,
    "maxResTime" : 1230.0,
    "pct1ResTime" : 1230.0,
    "pct2ResTime" : 1230.0,
    "pct3ResTime" : 1230.0,
    "throughput" : 0.8130081300813008,
    "receivedKBytesPerSec" : 1.3481326219512195,
    "sentKBytesPerSec" : 0.18578506097560976
  },
  "GET /flights/airlines" : {
    "transaction" : "GET /flights/airlines",
    "sampleCount" : 2456,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 126.91775244299671,
    "medianResTime" : 82.0,
    "minResTime" : 73.0,
    "maxResTime" : 1319.0,
    "pct1ResTime" : 319.0,
    "pct2ResTime" : 415.0,
    "pct3ResTime" : 508.8599999999997,
    "throughput" : 20.937587914851534,
    "receivedKBytesPerSec" : 24.597576427310933,
    "sentKBytesPerSec" : 3.148816932506969
  },
  "GET /hotels/search - San Francisco" : {
    "transaction" : "GET /hotels/search - San Francisco",
    "sampleCount" : 3360,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 158.55654761904793,
    "medianResTime" : 94.0,
    "minResTime" : 77.0,
    "maxResTime" : 1192.0,
    "pct1ResTime" : 370.9000000000001,
    "pct2ResTime" : 413.0,
    "pct3ResTime" : 430.0,
    "throughput" : 28.379337139768236,
    "receivedKBytesPerSec" : 202.39677649582757,
    "sentKBytesPerSec" : 6.346550981452076
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 21899,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 160.6471528380295,
    "medianResTime" : 87.0,
    "minResTime" : 0.0,
    "maxResTime" : 2200.0,
    "pct1ResTime" : 401.0,
    "pct2ResTime" : 486.0,
    "pct3ResTime" : 721.9800000000032,
    "throughput" : 60.525741197801075,
    "receivedKBytesPerSec" : 186.23228496143037,
    "sentKBytesPerSec" : 11.05481122586115
  },
  "GET /flights/locations?query=San" : {
    "transaction" : "GET /flights/locations?query=San",
    "sampleCount" : 2422,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.658959537572255,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 125.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 44.76999999999998,
    "throughput" : 20.858811168334565,
    "receivedKBytesPerSec" : 20.064383789853075,
    "sentKBytesPerSec" : 3.3610389089601598
  },
  "GET /flights/search - LAX to SFO" : {
    "transaction" : "GET /flights/search - LAX to SFO",
    "sampleCount" : 2482,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 142.62167606768776,
    "medianResTime" : 83.0,
    "minResTime" : 74.0,
    "maxResTime" : 1200.0,
    "pct1ResTime" : 360.0,
    "pct2ResTime" : 428.5499999999997,
    "pct3ResTime" : 588.1700000000001,
    "throughput" : 20.843830830729953,
    "receivedKBytesPerSec" : 70.8771669459001,
    "sentKBytesPerSec" : 4.1117713162182135
  },
  "GET /cars/locations?query=Los" : {
    "transaction" : "GET /cars/locations?query=Los",
    "sampleCount" : 2704,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 83.38720414201177,
    "medianResTime" : 82.0,
    "minResTime" : 75.0,
    "maxResTime" : 182.0,
    "pct1ResTime" : 89.0,
    "pct2ResTime" : 94.0,
    "pct3ResTime" : 112.0,
    "throughput" : 23.35201609769157,
    "receivedKBytesPerSec" : 25.358829981086938,
    "sentKBytesPerSec" : 3.6943619217051116
  }
}