jmeter/results/report-cache-b/statistics.json
{
  "GET /hotels/locations?query=New" : {
    "transaction" : "GET /hotels/locations?query=New",
    "sampleCount" : 3337,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 251.02007791429435,
    "medianResTime" : 173.0,
    "minResTime" : 152.0,
    "maxResTime" : 669.0,
    "pct1ResTime" : 479.0,
    "pct2ResTime" : 491.0,
    "pct3ResTime" : 512.6199999999999,
    "throughput" : 28.500905332923374,
    "receivedKBytesPerSec" : 61.4829100394802,
    "sentKBytesPerSec" : 4.564598119726009
  },
  "GET /flights/prices-by-date" : {
    "transaction" : "GET /flights/prices-by-date",
    "sampleCount" : 2423,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 395.87205943045785,
    "medianResTime" : 387.0,
    "minResTime" : 155.0,
    "maxResTime" : 1615.0,
    "pct1ResTime" : 642.0,
    "pct2ResTime" : 728.7999999999997,
    "pct3ResTime" : 1030.5599999999986,
    "throughput" : 20.933226204978013,
    "receivedKBytesPerSec" : 88.74134273028277,
    "sentKBytesPerSec" : 3.597898253980596
  },
  "GET /cars/search - Los Angeles" : {
    "transaction" : "GET /cars/search - Los Angeles",
    "sampleCount" : 2754,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 88.46259985475673,
    "medianResTime" : 84.0,
    "minResTime" : 76.0,
    "maxResTime" : 366.0,
    "pct1ResTime" : 94.0,
    "pct2ResTime" : 103.25,
    "pct3ResTime" : 189.44999999999982,
    "throughput" : 23.3239608387818,
    "receivedKBytesPerSec" : 80.24444729983232,
    "sentKBytesPerSec" : 5.307112183043125
  },
  "Login - Get Auth Token" : {
    "transaction" : "Login - Get Auth Token",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1293.0,
    "medianResTime" : 1293.0,
    "minResTime" : 1293.0,
    "maxResTime" : 1293.0,
    "pct1ResTime" : 1293.0,
    "pct2ResTime" : 1293.0,
    "pct3ResTime" : 1293.0,
    "throughput" : 0.7733952049497294,
    "receivedKBytesPerSec" : 1.2824463457076567,
    "sentKBytesPerSec" : 0.1767328886310905
  },
  "GET /flights/airlines" : {
    "transaction" : "GET /flights/airlines",
    "sampleCount" : 2473,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 111.7743631217145,
    "medianResTime" : 83.0,
    "minResTime" : 74.0,
    "maxResTime" : 923.0,
    "pct1ResTime" : 195.0,
    "pct2ResTime" : 293.8999999999992,
    "pct3ResTime" : 452.5199999999995,
    "throughput" : 21.0101524998938,
    "receivedKBytesPerSec" : 24.68282564196508,
    "sentKBytesPerSec" : 3.1597299658043414
  },
  "GET /hotels/search - San Francisco" : {
    "transaction" : "GET /hotels/search - San Francisco",
    "sampleCount" : 3369,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 156.14603739982167,
    "medianResTime" : 93.0,
    "minResTime" : 78.0,
    "maxResTime" : 1163.0,
    "pct1ResTime" : 399.0,
    "pct2ResTime" : 412.0,
    "pct3ResTime" : 423.3000000000002,
    "throughput" : 28.463046196478658,
    "receivedKBytesPerSec" : 202.9937757547692,
    "sentKBytesPerSec" : 6.36527107323595
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 22005,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 154.9578277664162,
    "medianResTime" : 88.0,
    "minResTime" : 0.0,
    "maxResTime" : 1615.0,
    "pct1ResTime" : 374.0,
    "pct2ResTime" : 466.0,
    "pct3ResTime" : 643.0,
    "throughput" : 60.8165250700613,
    "receivedKBytesPerSec" : 187.009829461364,
    "sentKBytesPerSec" : 11.104299355905876
  },
  "GET /flights/locations?query=San" : {
    "transaction" : "GET /flights/locations?query=San",
    "sampleCount" : 2447,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.532897425418891,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 170.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 62.51999999999998,
    "throughput" : 20.997983438451968,
    "receivedKBytesPerSec" : 20.19825555358905,
    "sentKBytesPerSec" : 3.383464128266186
  },
  "GET /flights/search - LAX to SFO" : {
    "transaction" : "GET /flights/search - LAX to SFO",
    "sampleCount" : 2499,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 127.92396958783509,
    "medianResTime" : 84.0,
    "minResTime" : 75.0,
    "maxResTime" : 1332.0,
    "pct1ResTime" : 262.0,
    "pct2ResTime" : 359.0,
    "pct3ResTime" : 539.0,
    "throughput" : 20.997882566463886,
    "receivedKBytesPerSec" : 71.40100302385474,
    "sentKBytesPerSec" : 4.1421604281501025
  },
  "GET /cars/locations?query=Los" : {
    "transaction" : "GET /cars/locations?query=Los",
    "sampleCount" : 2702,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 86.90895632864535,
    "medianResTime" : 83.0,
    "minResTime" : 74.0,
    "maxResTime" : 350.0,
    "pct1ResTime" : 92.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 189.9399999999996,
    "throughput" : 23.33434086100436,
    "receivedKBytesPerSec" : 25.339635778746924,
    "sentKBytesPerSec" : 3.6915656440260807
  }
}